src/Catalogs/ВидыВзаимодействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыВзаимодействий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей взаимодействию, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВидыВзаимодействий/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаСервере
// Процедура, обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	ДоступноРедактированиеПоПравам 				= ДоступноРедактированияВидовВзаимодействий();
	ДоступноРедактированиеТипВзаимодействия 	= НЕ Объект.Предопределенный ИЛИ (Объект.Предопределенный И НЕ ЗначениеЗаполнено(Объект.ВидВзаимодействия));
	Элементы.Наименование.ТолькоПросмотр      	= НЕ ДоступноРедактированиеПоПравам ИЛИ Объект.Предопределенный;
	Элементы.ВидВзаимодействия.ТолькоПросмотр 	= НЕ ДоступноРедактированиеПоПравам ИЛИ НЕ ДоступноРедактированиеТипВзаимодействия;
	
	Если Объект.Предопределенный Тогда 
		Элементы.Код.ТолькоПросмотр = Объект.Предопределенный;	
	КонецЕсли;
	
	СформироватьЭлементыМенюКартинкиВзаимодействия();
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	Если НЕ ЗначениеЗаполнено(Объект.ТемаПоУмолчанию) Тогда 
		ЭтаФорма.ТекущийЭлемент = Элементы.Заголовок;
	Иначе 
		ЭтаФорма.ТекущийЭлемент = Элементы.ФормаКнопкаСохранитьИЗакрыть;
	КонецЕсли;
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события формы "ПриЗаписиНаСервере".
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события формы "ПриЧтенииНаСервере".
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
КонецПроцедуры

&НаСервере
// Процедура - Сформировать элементы меню картинки взаимодействия.
//
Процедура СформироватьЭлементыМенюКартинкиВзаимодействия()
		
	Если ЗначениеЗаполнено(Объект.ИндексКартинки) Тогда
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Ширина 		= 2;
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Высота 		= 1;
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Отображение = ОтображениеКнопки.Картинка;
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Картинка    = БиблиотекаКартинок["ВидВзаимодействия_" + Объект.ИндексКартинки];
		Элементы.ГруппаКнопкиВыбораКартинки.ЦветФона 			= Новый Цвет(255, 255, 255);
	Иначе
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Ширина 		= 0;
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Высота 		= 0;		
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Отображение = ОтображениеКнопки.Текст;
		Элементы.ГруппаКнопкиВыбораКартинки.ЦветФона 			= Новый Цвет();
	КонецЕсли;
	
	Элементы.ГруппаВыборКартинкиВзаимодействия.Доступность = ДоступноРедактированиеПоПравам;		
	Элементы.ОткрытьВыборКартинкиВзаимодействия.Доступность = ДоступноРедактированиеПоПравам;
	
	ИндексГруппы = 0;
	
	Для ИндексЭлемента = 1 По 33 Цикл
		
		// Переход на новую строку, если в группе больше заданного числа элементов.
		Если Ост(ИндексЭлемента - 1, 11) = 0 Тогда
			
			// Создание подгруппы подчиненного меню.
			ПараметрыГруппы = Новый Структура;
			ПараметрыГруппы.Вставить("ГруппаЭлемента"			, Элементы.ГруппаВыборКартинкиВзаимодействияВсплывающая);
			ПараметрыГруппы.Вставить("ИмяЭлемента"   			, "ВыборКартинкиВзаимодействияСтрока_" + ИндексГруппы);
			ПараметрыГруппы.Вставить("Группировка"   			, ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная);
			ПараметрыГруппы.Вставить("ГоризонтальныйИнтервал"	, ИнтервалМеждуЭлементамиФормы.Половинный);
			
			ГруппаСтрокаЭлементов 	= УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппы);
			ИндексГруппы    		= ИндексГруппы + 1;
			
		КонецЕсли;
		
		ПараметрыГруппыКартинки = Новый Структура;
		ПараметрыГруппыКартинки.Вставить("ГруппаЭлемента", ГруппаСтрокаЭлементов);
		ПараметрыГруппыКартинки.Вставить("ИмяЭлемента"   , "ГруппаКартинкиВзаимодействия_" + ИндексЭлемента);
		ПараметрыГруппыКартинки.Вставить("Группировка"   , ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная);
		ПараметрыГруппыКартинки.Вставить("ЦветФона"      , ?(Объект.ИндексКартинки = ИндексЭлемента, Новый Цвет(213, 213, 213), Новый Цвет(255, 255, 255)));
		
		ГруппаКартинки = УправлениеИнтерфейсамиСервер.СоздатьЭлементГруппа(ЭтаФорма, ПараметрыГруппыКартинки);
		
		// Создание элемента картинки взаимодействия.
		ПараметрыЭлемента = Новый Структура;
		ПараметрыЭлемента.Вставить("ГруппаЭлемента"        , ГруппаКартинки);
		ПараметрыЭлемента.Вставить("ИмяЭлемента"           , "ВидВзаимодействия_" + ИндексЭлемента);
		ПараметрыЭлемента.Вставить("ИмяОбработчикаНажатия" , "ВыбратьКартинкуВзаимодействия_Подключаемый");
		ПараметрыЭлемента.Вставить("Картинка"              , БиблиотекаКартинок["ВидВзаимодействия_" + ИндексЭлемента]);
		ПараметрыЭлемента.Вставить("КнопкаОтображение"     , ОтображениеКнопки.Картинка);
		//ПараметрыЭлемента.Вставить("ГоризонтальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Половинный);
		
		УправлениеИнтерфейсамиСервер.СозданиеЭлементаМеню(ЭтаФорма, ПараметрыЭлемента);
		
	КонецЦикла;
	
	УправлениеИнтерфейсамиСервер.СформироватьРеквизитСтруктурыДанныхВсплывающихГрупп(ЭтаФорма, Новый Структура("ВыборКартинкиВзаимодействия", Ложь));

КонецПроцедуры

&НаКлиенте
// Процедура - Открыть выбор картинки взаимодействия.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ОткрытьВыборКартинкиВзаимодействия(Команда)
	
	Если НЕ ДоступноРедактированиеПоПравам Тогда
		Возврат;
	КонецЕсли;	
	
	Если Элементы.ГруппаВыборКартинкиВзаимодействияВсплывающая.Скрыта() Тогда 
		Элементы.ГруппаВыборКартинкиВзаимодействияВсплывающая.Показать();
	КонецЕсли;	
	
	//Если ПроверитьВидимостьВсплывающихГрупп("ВыборКартинкиВзаимодействия") Тогда
	//	УстановитьВидимостьВсплывающихГрупп("ВыборКартинкиВзаимодействия");
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбрать картинку взаимодействия.
//
Процедура ВыбратьКартинкуВзаимодействия_Подключаемый(Команда)
	
	ПредИндексКартинки    = Объект.ИндексКартинки;	
	Объект.ИндексКартинки = Число(СтрРазделить(Команда.Имя, "_")[1]); 
	
	Если Объект.ИндексКартинки = ПредИндексКартинки Тогда
		//Если НЕ Элементы.ГруппаВыборКартинкиВзаимодействияВсплывающая.Скрыта() Тогда 
		//	Элементы.ГруппаВыборКартинкиВзаимодействияВсплывающая.Скрыть();
		//КонецЕсли;
	ИначеЕсли Объект.ИндексКартинки <> ПредИндексКартинки Тогда
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Ширина 		= 2;
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Высота 		= 1;		
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Отображение = ОтображениеКнопки.Картинка;
		Элементы.ОткрытьВыборКартинкиВзаимодействия.Картинка    = БиблиотекаКартинок["ВидВзаимодействия_" + Объект.ИндексКартинки];	
		Элементы.ГруппаКнопкиВыбораКартинки.ЦветФона 			= Новый Цвет(255, 255, 255);
		
		Если ЗначениеЗаполнено(ПредИндексКартинки) Тогда
			Элементы["ГруппаКартинкиВзаимодействия_" + ПредИндексКартинки].ЦветФона = Новый Цвет(255, 255, 255);
		КонецЕсли;	
		Элементы["ГруппаКартинкиВзаимодействия_" + Объект.ИндексКартинки].ЦветФона = Новый Цвет(213, 213, 213);
		
		Модифицированность = Истина;
	КонецЕсли;
	
	Если НЕ Элементы.ГруппаВыборКартинкиВзаимодействияВсплывающая.Скрыта() Тогда 
		Элементы.ГруппаВыборКартинкиВзаимодействияВсплывающая.Скрыть();
	КонецЕсли;
	
	УстановитьФокусЭлемента();

	//СнятьВидимостьВсплывающихГрупп("ВыборКартинкиВзаимодействия");
	
КонецПроцедуры

&НаКлиенте
// Функция - Проверить видимость всплывающей группы.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПроверитьВидимостьВсплывающихГрупп(ИмяЭлемента)
	
	Результат = УправлениеИнтерфейсамиКлиент.ПроверитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента);
	
	Если Результат = Ложь Тогда 
		УстановитьФокусЭлемента();
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
// Процедура - Установить видимость всплывающих групп.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура УстановитьВидимостьВсплывающихГрупп(ИмяЭлемента)
	
	УправлениеИнтерфейсамиКлиент.УстановитьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Снять видимость всплывающих групп.
//
// Параметры:
//  ИмяВзаимодействия	 - 	 - 
//  Видимость			 - 	 - 
//
Процедура СнятьВидимостьВсплывающихГрупп(ИмяЭлемента)
	
	УправлениеИнтерфейсамиКлиент.СнятьВидимостьВсплывающихГрупп(ЭтаФорма, ИмяЭлемента);
	
	УстановитьФокусЭлемента();	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Установить фокус элемента.
//
Процедура УстановитьФокусЭлемента()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ФормаКнопкаСохранитьИЗакрыть;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Доступно редактирования видов взаимодействий.
// 
// Возвращаемое значение:
//   - 
//
Функция ДоступноРедактированияВидовВзаимодействий()
	
	Возврат РольДоступна(Метаданные.Роли.ДобавлениеИзменениеБазовойНСИ)
	        ИЛИ РольДоступна(Метаданные.Роли.ПолныеПрава);
			
КонецФункции

#КонецОбласти
